In [25]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math

In [26]:
data = pd.read_excel('D:/Tugas/KULIAH/SMT6/DataMining/UAS/dataset_UAS-main/dataset_UAS-main/soal2.xls')

In [27]:
# Titik tetangga terdekat (1,0,0)

In [28]:
df = pd.DataFrame(data)
df

  Category  Weather V-1  Holiday V-2  Game V-3  Qty
0        A            5            1         0  250
1        B            3            1         1  200
2        C            1            1         0   75
3        D            4            1         1  400
4        E            4            0         0  150
5        F            2            0         0   50

In [30]:
dis = []
for i in range(6):
    dis.append(math.sqrt((float(df.iloc[i]['Weather V-1'])-1)**2+
                        (float(df.iloc[i]['Holiday V-2'])-0)**2+
                        (float(df.iloc[i]['Game V-3'])-0)**2))

In [31]:
df['dis'] = dis
df

  Category  Weather V-1  Holiday V-2  Game V-3  Qty       dis
0        A            5            1         0  250  4.123106
1        B            3            1         1  200  2.449490
2        C            1            1         0   75  1.000000
3        D            4            1         1  400  3.316625
4        E            4            0         0  150  3.000000
5        F            2            0         0   50  1.000000

In [32]:
y = df.sort_values('dis').head(3)

In [33]:
x = y["Qty"]
x

2     75
5     50
1    200
Name: Qty, dtype: int64

In [34]:
np.mean(x)

108.33333333333333

In [35]:
# Jadi apabila cuaca buruk, tidak sedang hari libur dan tidak ada game roti yang diproduksi pada hari itu adalah sebanyak 108 roti

In [13]:
# Titik tetangga terdekat (4,1,1)

In [36]:
dis = []
for i in range(6):
    dis.append(math.sqrt((float(df.iloc[i]['Weather V-1'])-4)**2+
                        (float(df.iloc[i]['Holiday V-2'])-1)**2+
                        (float(df.iloc[i]['Game V-3'])-1)**2))

In [37]:
df['dis'] = dis
df

  Category  Weather V-1  Holiday V-2  Game V-3  Qty       dis
0        A            5            1         0  250  1.414214
1        B            3            1         1  200  1.000000
2        C            1            1         0   75  3.162278
3        D            4            1         1  400  0.000000
4        E            4            0         0  150  1.414214
5        F            2            0         0   50  2.449490

In [40]:
z = df.sort_values('dis').head(3)

In [41]:
y = z["Qty"]
y

3    400
1    200
0    250
Name: Qty, dtype: int64

In [43]:
np.mean(y)

283.3333333333333

In [44]:
# Jadi apabila cuaca baik, sedang hari libur dan game roti yang diproduksi pada hari itu adalah sebanyak 283 roti

In [45]:
df.to_excel('D:/Tugas/KULIAH/SMT6/DataMining/UAS/dataset_UAS-main/dataset_UAS-main/hasil2.xls')